<template>
  <el-container>
    <!-- 头部 -->
    <main-header :HeaderTitle="headerTitle"></main-header>
    <section class="calendar-wrap">
      <el-calendar v-model="timeValue" id="calendar">
        <template slot="dateCell" slot-scope="{date, data}">
          <!-- 日程日期 -->
          <div @click="changeTime(date,data)">
            <div class="calendar-day">{{ data.day.split('-').slice(2).join('-') }}</div>
            <div v-for="(item, index) in calendarData" :key="index">
              <div v-if="item === data.day.split('-').slice(1).join('-')">
                <el-badge is-dot class="item"></el-badge>
              </div>
            </div>
          </div>
        </template>
      </el-calendar>
      <div v-loading="isLoading">
        <el-card class="schedule-card"
          v-for="(item, key, index) in scheduleList"
          :key="index">
          <div slot="header" class="clearfix">
            <span v-if="key === 'ine'">能源中心信息</span>
            <span v-if="key === 'shfe'">上期所信息</span>
            <span v-if="key === 'cffex'">中金所信息</span>
            <span v-if="key === 'zce_future'">郑商所期货信息</span>
            <span v-if="key === 'zce_option'">郑商所期权信息</span>
            <span v-if="key === 'dce_future'">大商所期货信息</span>
            <span v-if="key === 'dce_option'">大商所期权信息</span>
            <el-button icon="el-icon-bell" type="text"></el-button>
          </div>
          <div v-for="(cont, index) in item.info"
            :key="index">
            <h4>{{ cont.title }}</h4>
            <p class="content-txt">{{ cont.content }}</p>
          </div>
        </el-card>
      </div>
    </section>
  </el-container>
</template>

<script>
import moment from 'moment'
import axios from 'axios'
import mainHeader from '@/layout/header'
import { Message } from 'element-ui'
const qs = require('qs')

export default {
  name: 'MyCalendars',
  components: {
    mainHeader
  },
  data () {
    return {
      headerTitle: '交易日历',
      timeValue: new Date(),
      calendarData: [],
      isLoading: false,
      token: this.$store.state.user.token,
      scheduleList: []
    }
  },

  created(){
    this.getCalendarStatus()
    this.$nextTick(() => {
      this.getCalendarData(moment(this.timeValue).format('YYYY-MM-DD'))
    })
  },

  mounted() { },

  methods:{
    logout(){
      // return this.$store.dispatch('user/logout')
      this.$store
        .dispatch('user/logout', {
          token: ''
        })
        .then(res => {
          location.reload()
        })
        .catch(error => {
          
        })
    },
    // 获取当月日历
    getCalendarStatus(){
      var data = {
        year: '2020',
        month: '12'
      }
      var config = {
        method: 'post',
        url: 'https://tswkapp.wkjyqh.com:9443/department/service/key/calendarService/getCalendarStatus',
        headers: { 
          'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
        },
        data : qs.stringify(data)
      }
      //axios(config).then(res => {
        let res = {"errorCode":"0","data":["12-01","12-02","12-03","12-04","12-07","12-08","12-09","12-10","12-11","12-14","12-15","12-16","12-17","12-18","12-21","12-22","12-24","12-25","12-28","12-29","12-30","12-31"]}
        this.calendarData = res.data
        //this.calendarData = res.data.data
      //})
    },
    // 获取日程
    getCalendarData(date){
      var data = {
        date: date
      }
      var config = {
        method: 'post',
        url: 'https://tswkapp.wkjyqh.com:9443/department/service/key/calendarService/getCalendarData',
        headers: { 
          'Content-Type': 'application/x-www-form-urlencoded;charset=UTF-8'
        },
        data : qs.stringify(data)
      }
      this.isLoading = true
      //axios(config).then(res => {
        let res = {
        data: {"errorCode":"0","data":{"ine":{"isAlarm":0,"id":8199,"info":[{"title":"交易提示","content":""},{"title":"交割提示","content":""},{"title":"结算提示","content":"nr2012合约退出单向大边保证金优惠。"}]},"shfe":{"isAlarm":0,"id":8294,"info":[{"title":"交易提示","content":""},{"title":"交割提示","content":""},{"title":"结算提示","content":"ag2012, zn2012, wr2012, ss2012, sp2012, sn2012, rb2012, pb2012, ni2012, hc2012, cu2012, bu2012, au2012, al2012合约退出单向大边保证金优惠。"}]},"zce_future":{"isAlarm":0,"id":7606,"info":[{"title":"限仓提示","content":""},{"title":"合约挂牌","content":"今日ZC2112合约挂盘交易，基准价为其最近合约月份上一交易日结算价。"},{"title":"合约到期","content":""},{"title":"保证金","content":""}]},"dce_option":{"isAlarm":0,"id":8277,"info":[{"title":"交易提示","content":"c2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nc2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nc2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nc2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nc2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nc2111  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2012  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2102  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2104  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2106  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2108  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2110  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\ni2111  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nl2012  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2102  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2104  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2106  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2108  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2110  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nl2111  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为10000手；非期货公司会员卖持仓限额为10000手；客户买持仓限额为10000手；客户卖持仓限额为10000手\nm2012  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2108  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\nm2111  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为40000手；非期货公司会员卖持仓限额为40000手；客户买持仓限额为40000手；客户卖持仓限额为40000手\npg2012  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2102  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2104  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2106  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2108  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2110  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npg2111  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为8000手；非期货公司会员卖持仓限额为8000手；客户买持仓限额为8000手；客户卖持仓限额为8000手\npp2012  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2102  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2104  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2106  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2108  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\npp2110  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2012  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2101  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2102  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2103  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2104  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2105  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2106  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2107  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2108  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2109  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\nv2110  从今日起，期货公司会员无买持仓限额限制期货公司会员无卖持仓限额限制；非期货公司会员买持仓限额为20000手；非期货公司会员卖持仓限额为20000手；客户买持仓限额为20000手；客户卖持仓限额为20000手\n"}]},"dce_future":{"isAlarm":0,"id":8273,"info":[{"title":"交易提示","content":"p2012  品种棕榈油仓单到期日为20201222,还有14天到期\np2101  品种棕榈油仓单到期日为20201222,还有14天到期\np2102  品种棕榈油仓单到期日为20201222,还有14天到期\np2103  品种棕榈油仓单到期日为20201222,还有14天到期\np2104  品种棕榈油仓单到期日为20201222,还有14天到期\np2105  品种棕榈油仓单到期日为20201222,还有14天到期\np2106  品种棕榈油仓单到期日为20201222,还有14天到期\np2107  品种棕榈油仓单到期日为20201222,还有14天到期\np2108  品种棕榈油仓单到期日为20201222,还有14天到期\np2109  品种棕榈油仓单到期日为20201222,还有14天到期\np2110  品种棕榈油仓单到期日为20201222,还有14天到期\np2111  品种棕榈油仓单到期日为20201222,还有14天到期\nrr2012  品种粳米仓单到期日为20201217,还有9天到期\nrr2101  品种粳米仓单到期日为20201217,还有9天到期\nrr2102  品种粳米仓单到期日为20201217,还有9天到期\nrr2103  品种粳米仓单到期日为20201217,还有9天到期\nrr2104  品种粳米仓单到期日为20201217,还有9天到期\nrr2105  品种粳米仓单到期日为20201217,还有9天到期\nrr2106  品种粳米仓单到期日为20201217,还有9天到期\nrr2107  品种粳米仓单到期日为20201217,还有9天到期\nrr2108  品种粳米仓单到期日为20201217,还有9天到期\nrr2109  品种粳米仓单到期日为20201217,还有9天到期\nrr2110  品种粳米仓单到期日为20201217,还有9天到期\nrr2111  品种粳米仓单到期日为20201217,还有9天到期\n"}]}}}
        }
        this.isLoading = false
        this.scheduleList = []
        if(res.data.errorCode == '0'){
          this.scheduleList = res.data.data
        } else {
          Message({
            message: res.data.msg || '请求失败',
            type: 'error'
          })
        }
      //})
    },
    //点击天数
   changeTime(date, data) {
     this.getCalendarData(data.day)
    }
  }
}
</script>

<style>
.calendar-wrap {
  width: 100%;
  height: 100%;
  box-sizing: border-box;
}

.calendar-wrap .el-calendar-table .el-calendar-day{
  height: auto;
}

.calendar-day {
  text-align: center;
  color: #202535;
  line-height: 30px;
  font-size: 12px;

}

.is-selected {
  color: #F8A535;
  font-size: 10px;
  margin-top: 5px;
}

.schedule-card{
  margin: 0 20px 10px;
}
.schedule-card h4,
.schedule-card p{
  text-align: left;
  margin: 0;
  font-size: 14px;
}
.schedule-card h4{
  color: rgba(208 64 64);
  border-left: 3px solid rgba(208 64 64);
  margin-bottom: 10px;
  height: 10px;
  line-height: 10px;
  padding-left: 3px;
  margin-left: -5px;
}
.schedule-card .el-card__header{
  padding-top: 10px;
  padding-bottom: 10px;
  background: rgba(208 64 64);
  text-align: left;
  color: #fff;
}
.schedule-card .el-button{
  color: #fff;
  float: right;
  padding: 5px 0;
}
.schedule-card .content-txt{
  overflow:hidden;
  text-overflow:ellipsis;
  display:-webkit-box; 
  -webkit-box-orient:vertical;
  -webkit-line-clamp:2;
}


</style>
